Autodesk.Revit.DB.PerformanceAdviserRuleId.op_Inequality(Autodesk.Revit.DB.PerformanceAdviserRuleId,Autodesk.Revit.DB.PerformanceAdviserRuleId)
Compares two PerformanceAdviserRuleId instances.
first: The first PerformanceAdviserRuleId.
second: The second PerformanceAdviserRuleId.
Returns: True if the inputs are different, false if they are identical.

Autodesk.Revit.DB.PerformanceAdviserRuleId.op_Equality(Autodesk.Revit.DB.PerformanceAdviserRuleId,Autodesk.Revit.DB.PerformanceAdviserRuleId)
Compares two PerformanceAdviserRuleId instances.
first: The first PerformanceAdviserRuleId.
second: The second PerformanceAdviserRuleId.
Returns: True if the inputs are identical, false if they are different.

Autodesk.Revit.DB.PerformanceAdviserRuleId.#ctor(System.Guid)
Creates a new PerformanceAdviserRuleId instance.
guid: The identifier for the PerformanceAdviserRuleId.

Autodesk.Revit.DB.PerformanceAdviserRuleId
The unique identifier of a PerformanceAdviserRule
Remarks:
Each performance adviser rule registered in application must be given a unique id
that can be used to identify and unregister rule later.
Since:
2012